'''
прога, що виводить кількість кожного символа з введеної строки,
наприклад:
st = 'as 23 fdfdg544' #введена строка
'''

st = 'as 23 fdfdg544'

for i in st:
   print(i, ' = ', st.count(i))


'''
1)  есть лист:
numbers = [1, 2, 3, 4, 5, 6, 7, 8]
создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен 4
пример:
['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']
'''
'''
numbers = [1, 2, 3, 4, 5, 6, 7, 8]
list = []
for i in numbers:
    if i > 4:
        list.append('GT')
    else:
        list.append('LT')
print(list)
'''

'''
2) есть два листа:
list1 = [1, 2, 3, 4, 5]
list2 = [-1, 7, 10, -5, -2]

записать в лист тюплы (x,y) если x+y == 0
пример:
[(1, -1), (2, -2), (5, -5)]
'''
'''
list1 = [1, 2, 3, 4, 5]
list2 = [-1, 7, 10, -5, -2]
t = []
for i in list1:
    for j in list2:
        if i + j == 0:
            t.append((i, j))
print(t)
'''